public/man/man1/lsirq.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - lsirq.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - lsirq.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>lsirq - utility to display kernel interrupt information</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>lsirq</strong> [options]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Display kernel interrupt counter information.</p>
<p>
The default output is subject to change. So whenever possible, you
should avoid using default outputs in your scripts. Always explicitly
define expected columns by using <strong>–output</strong>.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>-n</strong>, <strong>–noheadings</strong></p>
<blockquote>
<p>Don&#39;t print headings.</p>
</blockquote>
<p>
<strong>-o</strong>, <strong>–output</strong> <em>list</em></p>
<blockquote>
<p>Specify which output columns to print. Use <strong>–help</strong> to get a list of all
supported columns. The default list of columns may be extended if list
is specified in the format <em>+list</em>.</p>
</blockquote>
<p>
<strong>-s</strong>, <strong>–sort</strong> <em>column</em></p>
<blockquote>
<p>Specify sort criteria by column name. See <strong>–help</strong> output to get column
names.</p>
</blockquote>
<p>
<strong>-J</strong>, <strong>–json</strong></p>
<blockquote>
<p>Use JSON output format.</p>
</blockquote>
<p>
<strong>-P</strong>, <strong>–pairs</strong></p>
<blockquote>
<p>Produce output in the form of key=&#34;value&#34; pairs. All potentially unsafe
characters are hex-escaped (\x&lt;code&gt;).</p>
</blockquote>
<p>
<strong>-S</strong>, <strong>–softirq</strong></p>
<blockquote>
<p>Show softirqs information.</p>
</blockquote>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Display help text and exit.</p>
</blockquote>
<p>
<strong>-V</strong>, <strong>–version</strong></p>
<blockquote>
<p>Print version and exit.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
AUTHORS
</h2>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
REPORTING BUGS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>For bug reports, use the issue tracker at
&lt;<a href="https://github.com/util-linux/util-linux/issues">https://github.com/util-linux/util-linux/issues</a>&gt;.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
AVAILABILITY
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>The <strong>lsirq</strong> command is part of the util-linux package which can be
downloaded from <em>Linux Kernel Archive</em>
&lt;<a href="https://www.kernel.org/pub/linux/utils/util-linux/">https://www.kernel.org/pub/linux/utils/util-linux/</a>&gt;.</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
